[
    {
        "link": "Ping Pong/index",
        "repository": "https://github.com/NielRodrigues/ping-pong",
        "img": "ping-pong.png",
        "title": "PING PONG",
        "description": "Esse é um projeto básico desenvolvido pelo canvas no HTML. É um jogo que manipula a posição de elementos na tela em tempo real.",
        "date": "02-22-2023",
        "tech": ["html5", "css3", "javascript"]
    },
    {
        "link": "https://carlosdanieldev.netlify.app/",
        "repository": "https://github.com/NielRodrigues/portfolio",
        "img": "portifolio.png",
        "title": "Portifólio",
        "description": "Ce portfolio a été développé par moi en utilisant mes connaissances avancées en HTML5, CSS3 et Javascript. Pour ce portfolio, j'ai d'abord développé le design dans Figma en appliquant mes compétences en tant que UX/UI Design. J'ai également utilisé le préprocesseur CSS pour construire ce site, SASS. Certaines bibliothèques comme Typed.JS et Owl Carousel ont été utilisées dans ce portfolio pour ce site. J'ai également développé des animations pour le Menu Mobile en utilisant Javascript et CSS, en appliquant également les concepts de réactivité. En Javascript, j'ai également appliqué mes connaissances en AJAX pour utiliser une API pour envoyer des données de formulaire à mon e-mail.",
        "date": "03-21-2023",
        "tech": ["html5", "css3", "javascript", "sass"]
    },
    {
        "link": "https://cr-reservadehotel-2703.netlify.app/",
        "repository": "https://github.com/NielRodrigues/Reserva-de-Hotel",
        "img": "reserva-de-hotel.png",
        "title": "Reserva de Hotel",
        "description": "C'est un projet que j'ai développé pour appliquer mes connaissances dans le cadre 'Bootstrap'. L'objectif principal du projet était d'utiliser les classes Bootstrap, de travailler avec des balises et des formulaires. Aucune automatisation n'a été effectuée à l'aide de Javascript pour ce projet. Je viens d'appliquer mes connaissances pour travailler avec UX/UI Design, ainsi que des connaissances avancées en HTML et CSS. Pour ce projet j'ai utilisé, en plus de HTML5 et CSS3, le préprocesseur CSS, Sass, ainsi que le framework CSS, Bootstrap. J'ai également utilisé certaines bibliothèques comme Font Awesome et Materialize Icons.",
        "date": "03-27-2023",
        "tech": ["html5", "css3", "bootstrap", "sass"]
    },
    {
        "link": "https://cr-todolist-2903.netlify.app/",
        "repository": "https://github.com/Adromane/todo-list-yt",
        "img": "lista-de-tarefas.png",
        "title": "Lista de Tarefas",
        "description": "Mon premier projet en React JS. Ce projet que j'ai développé pour appliquer mes connaissances en React JS ainsi que mes connaissances en HTML CSS et Javascript. Le projet consiste en une simple liste de tâches où l'utilisateur peut ajouter ou supprimer des tâches dans une liste. Dans ce projet, je n'ai pas travaillé avec le stockage local, donc les informations sont réinitialisées lorsque l'utilisateur recharge la page, car le focus ne fonctionnait pas avec la mémoire locale, donc le projet consistait simplement à appliquer les connaissances, les principes fondamentaux et les concepts de React, tels que comme : États, Composants, Props, JSX, etc...",
        "date": "03-29-2023",
        "tech": ["html5", "css3", "javascript", "react"]
    },
    {
        "link": "https://cr-controlefinanceiro-0104.netlify.app/",
        "repository": "https://github.com/NielRodrigues/",
        "img": "controle-financeiro.png",
        "title": "Controle Financeiro",
        "description": "Esse projeto eu contrui um aplicação web para controle financeiro, na qual o usuário detalhe seu recebimnetos e gastos. Para esse projeto, eu construi uma aplicação usando o React JS. O conceito desse projeto foi o mesmo utilizado no projeto da Lista de Tarefas, porém eu ainda utilizei o Local Storage para as informações não se perderem quando recarregar a página. Todos os fundamentos de React foram utilizado nesse projeto, bem como os conceitos avançados em HTML, CSS e Javascript",
        "date": "04-01-2023",
        "tech": ["html5", "css3", "javascript", "react"]
    },
    {
        "link": "https://cr-api-github-0504.netlify.app/",
        "repository": "https://github.com/Adromane/API-github",
        "img": "api-github.png",
        "title": "API GitHub",
        "description": "Ce projet en ReactJS était un projet pour lequel j'ai utilisé tous les fondamentaux avancés que j'ai appris de cette Lib, en utilisant des États, des Props, des Composants, etc., en plus de mes connaissances en JavaScript, HTML et CSS. Dans la partie Front End, j'ai développé le style à l'aide des composants stylisés. En ce qui concerne la demande d'API GitHub, j'ai utilisé Axios pour obtenir des données de cette API de manière asynchrone et enregistrer toutes ces données, telles que les informations utilisateur et les référentiels, dans une variable d'état au sein d'un composant fonctionnel..",
        "date": "04-05-2023",
        "tech": ["html5", "css3", "javascript", "react"]
    },
    {
        "link": "https://cr-weatherapp-1004.netlify.app/",
        "repository": "https://github.com/Adromane/APLI-m-t-o-et-m-t-o",
        "img": "weather-app.png",
        "title": "Weather APP",
        "description": "Il s'agit d'une application construite en React qui interroge la météo et la météo de chaque ville. L'application consomme une API gratuite (Open Weather) dans laquelle l'utilisateur recherche une ville et l'application renvoie des données et des informations et les affiche à l'écran. Pour cette application, une requête API a été effectuée à l'aide de 'FETCH'. Des concepts tels que States, Components, Styled Components, JSX, API Request, ont été utilisés dans ce projet.",
        "date": "04-10-2023",
        "tech": ["html5", "css3", "javascript", "react"]
    },
    {
        "link": "https://cr-pedidoonline-1704.netlify.app/",
        "repository": "https://github.com/NielRodrigues/pedido-online",
        "img": "pedido-online.png",
        "title": "Pedido Online",
        "description": "O 'Pedido Online' foi um projeto que desenvolvi para exemplicar um sistema de um restaurante delivery. O projeto foi feito em React com TypeScript aplicando todos os fundamentos de React, como Components, States e Props, além de Styled Components, Requisição de uma API interna utilizando o Axios e criação de Hooks personalizados.",
        "date": "04-17-2023",
        "tech": ["html5", "css3", "typescript", "react"]
    },
    
    {
        "link": "https://blocodenotasonline.netlify.app/",
        "repository": "https://github.com/NielRodrigues/bloco-de-notas-online",
        "img": "bloco-de-notas.png",
        "title": "Bloco de Notas Online",
        "description": "💻 Projeto: <br> Esse é um projeto fullstack simples feito em ReactJS + NodeJS. Ele serve para registrar novas anotações dos usuários (uma espécie de bloco de notas online) que são salvas automaticamente e pode ser acessada de qualquer dispositivo, e para registrar essas anotações é necessário registrar uma conta no site e fazer o login.<br><br>🛠️ Tecnologias utilizadas:<br>▪ ReactJS: utilizei o ReactJS para criar a parte do Frontend, eu escolhi ele por causa da sua criação de intefarce com componentização.<br>▪ NodeJS: o NodeJS foi utilizado para criar a API e consumir os dados diretamente do Banco de Dados.<br>▪ PostgreSQL: o Banco de Dados utilizado nesse projeto foi o PostgreSQL pela sua facilidade de se relacionar/conectar com NodeJS.<br>▪ ExpressJS: o Express foi o framework utilizado para realizar as requisições HTTP do lado do servidor pela sua facilidade na sua integração e organização do nosso projeto no padrão MVC.<br>▪ Sequelize: o ORM usado para esse projeto foi o Sequelize para realizar o CRUD e nos conectarmos e operarmos o Banco de Dados.<br>▪ Axios: o Axios foi a biblioteca utilizada no Frontend para realizar a integração à API.<br>▪ Local Storage: utilizei o Local Storage do navegador para armazenar os dados de Login de uma forma mais simples.<br>▪ Render: para fazer deploy da API e do Banco de Dados.<br><br>▪ Outros: outras bibliotecas como o Multer (para upload de arquivos) e Bcrypt (para criptografia das senhas) também foram utilizadas nesse projeto no Backend.",
        "date": "05-29-2023",
        "tech": ["html5", "css3", "javascript", "react", "node js", "postgresql"]
    }
]
