[
    {
        "link": "JavaScript de base",
        "img": "javascript.svg",
        "title": "JavaScript de base",
        "description": "Dans ce cours Javascript, j'ai compris toutes les bases de ce langage, à commencer par les variables, les expressions et les opérateurs, la structure de décision et la répétition, etc.",
        "date": "02-22-2023",
        "tech": ["javascript"]
    },
    {
        "link": "Logique de programmation de base",
        "img": "programacao.png",
        "title": "JavaScript de base",
        "description": "Il s'agit d'un cours de logique en programmation de base que j'ai suivi dans le cadre du cours Front End Master chez Dev Samurai.",
        "date": "02-22-2023",
        "tech": []
    },
    {
        "link": "Logique de programmation avancée",
        "img": "programacao.png",
        "title": "LOGIQUE DE PROGRAMMATION - Avancé",
        "description": "Dans ce cours, j'ai appris comment un code fonctionne en pratique, comment il interagit avec la machine, en plus de structures plus avancées.",
        "date": "02-22-2023",
        "tech": []
    },
    {
        "link": "JavaScript - avancée",
        "img": "javascript.svg",
        "title": "JavaScript - avancée",
        "description": "Déjà dans ce cours Javascript avancé, j'ai appris les fonctions, la manipulation de données, la manipulation de tableaux, DOM, les promesses, JSON, Ajax, etc.",
        "date": "02-28-2023",
        "tech": ["javascript"]
    },
    {
        "link": "html_css",
        "img": "html5.svg",
        "title": "HTML POUR LES PROGRAMMEURS",
        "description": "Ici, j'ai appris toute la structure du HTML. Outre les concepts de base et les principales balises, formulaires, listes, tableaux, etc.",
        "date": "03-01-2023",
        "tech": ["html5"]
    },
    {
        "link": "TypeScript de base",
        "img": "typescript.svg",
        "title": "TypeScript de base",
        "description": "Dans le cours TypeScript chez Dev Samurai, j'ai appris les concepts de base, le typage des données, l'orientation des objets, les fonctions, etc.",
        "date": "03-03-2023",
        "tech": ["typescript"]
    },
    {
        "link": "html_css",
        "img": "html5.svg",
        "title": "Comprendre HTML avec CSS",
        "description": "Dans le cours HTML avec CSS, j'ai appris les concepts de balises, les attributs que chacune peut recevoir, en plus de l'intégration de la page HTML avec CSS. À propos des concepts de formulaire, de la syntaxe CSS, des sélecteurs, des couleurs, des textes, etc.",
        "date": "03-12-2023",
        "tech": ["html5", "css3"]
    },
    {
        "link": "bootstrap-support",
        "img": "bootstrap.svg",
        "title": "Sites Web avec Bootstrap",
        "description": "Dans ce cours j'ai découvert le framework CSS 'Bootstrap', que je ne connaissais pas et j'ai pu connaître et développer mes projets avec des classes toutes faites pré-établies par le framework, ce qui permet une productivité plus efficace.",
        "date": "03-23-2023",
        "tech": ["bootstrap"]
    },
    {
        "link": "Fondamentaux de ReactJS",
        "img": "react.svg",
        "title": "Fundamentos do React JS",
        "description": "No curso de React eu aprendi todos os fundamentos do React, os conceitos de Components,States, Props, etc. Aprendi a como criar um aplicação Web com React JS e tudo que essa Lib do Javascript é capaz de fazer.",
        "date": "03-29-2023",
        "tech": ["react"]
    },
    {
        "link": "Node.JS Básico",
        "img": "node-js.svg",
        "title": "Node.JS Básico",
        "description": "Nesse curso de 'Node.JS Básico' eu conseguir aprender todos os fundamentos e conceitos do NodeJS. Eu também aprendi os conceitos de uma API Rest, os status que um servidor pode repassar para o usuário, a como criar um servidor em ExpressJS, consumir parâmetros Query e Route, e utilizar o Insomnia.",
        "date": "04-19-2023",
        "tech": ["nodejs"]
    },
    {
        "link": "Banco de Dados Básico",
        "img": "postgresql.svg",
        "title": "Banco de Dados Básico",
        "description": "Esse foi o primeiro curso sobre Banco de Dados que eu fiz. O gerecidador de Banco de Dados utilizado foi o PostgreSQL. Nesse curso eu aprendi como funciona um banco de dados e seus conceitos básicos, estruturar um banco de dados (MER), atributos e tipos de dados, além de aprender os comandos básicos da manipulação de tabelas, como INSERT, SELECT, UPDATE, DELETE, etc...",
        "date": "04-25-2023",
        "tech": ["postgresql"]
    },
    {
        "link": "Banco de Dados Avançado",
        "img": "postgresql.svg",
        "title": "Banco de Dados Avançado",
        "description": "Nesse curso sobre Banco de Dados avançado eu aprendi a manipular as tabelas com filtros avançados com o uso do LIKE, IN, BETWEEN e LIMIT. Além de funções de agregação, combinar tabelas com o uso do JOIN, fazer transações e funções e os conceitos de ORMs, nuvens e NoSQL.",
        "date": "05-03-2023",
        "tech": ["postgresql"]
    },
    {
        "link": "Node.JS Avançado",
        "img": "node-js.svg",
        "title": "Node.JS Avançado",
        "description": "No curso de Node JS Avançado eu aprendi como funciona toda Arquitetura de código MVC e fazer um estrutura de projeto moderna. Além de trabalhar com ExpressJS eu trabalhei com framework ORM Sequelize com uso de Controllers e Migrations para trabalhar com Banco de Dados, criei uma API Profissional e Middlewares, e trabalhei com algumas bibliotecas externas como Multer, Nodemailer, e JWT.  ",
        "date": "05-11-2023",
        "tech": ["nodejs"]
    }
]
